<h1>Curso de Pandas</h1>
<h2>Análisis y manipulación de datos</h2>

In [1]:
%cd C:\Development\Python\Data exploration with Pandas

C:\Development\Python\Data exploration with Pandas

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.0.3'

<h3>Series</h3>
<p>Una serie es un vector con un índice asociado.</p>

In [4]:
my_series = pd.Series([10, 20, 30, 40, 50], index=("a", "b", "c", "d", "e"))
my_series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [5]:
type(my_series)

pandas.core.series.Series

In [6]:
my_series["a"]

10

In [7]:
my_series["b":"d"]

b    20
c    30
d    40
dtype: int64

In [8]:
my_series + 5

a    15
b    25
c    35
d    45
e    55
dtype: int64

In [9]:
my_series * 2

a     20
b     40
c     60
d     80
e    100
dtype: int64

In [10]:
my_series / 2

a     5.0
b    10.0
c    15.0
d    20.0
e    25.0
dtype: float64

In [11]:
my_series.dtype

dtype('int64')

In [12]:
my_series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [13]:
type(my_series[0])

numpy.int64

In [14]:
my_series.size

5

In [15]:
my_series.shape

(5,)

In [16]:
my_series.head(3)

a    10
b    20
c    30
dtype: int64

In [17]:
my_series.tail(2)

d    40
e    50
dtype: int64

In [18]:
my_series.describe

<bound method NDFrame.describe of a    10
b    20
c    30
d    40
e    50
dtype: int64>

In [19]:
my_series.describe()

count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
dtype: float64

In [20]:
my_series.sort_values(ascending=False)

e    50
d    40
c    30
b    20
a    10
dtype: int64

<h3>DataFrames</h3>

In [21]:
data = { "Nombre" : ["Miguel", "Emilio", "Pedro", "Juan"],
        "Edad" : [25,30,28,35],
        "Ciudad": ["Albacete", "Murcia", "Salamanca", "Vilassar de Mar"]
       }

In [22]:
data

{'Nombre': ['Miguel', 'Emilio', 'Pedro', 'Juan'],
 'Edad': [25, 30, 28, 35],
 'Ciudad': ['Albacete', 'Murcia', 'Salamanca', 'Vilassar de Mar']}

In [23]:
df = pd.DataFrame(data)

In [24]:
df

   Nombre  Edad           Ciudad
0  Miguel    25         Albacete
1  Emilio    30           Murcia
2   Pedro    28        Salamanca
3    Juan    35  Vilassar de Mar

In [25]:
data_list = [["Miguel", 25, "Albacete"], ["Emilio", 30, "Murcia"], ["Pedro", 28, "Salamanca"], ["Juan", 35, "Vilassar de Mar"]]

In [26]:
data_list

[['Miguel', 25, 'Albacete'],
 ['Emilio', 30, 'Murcia'],
 ['Pedro', 28, 'Salamanca'],
 ['Juan', 35, 'Vilassar de Mar']]

In [27]:
df_list = pd.DataFrame(data_list, columns = ["Nombre", "Edad", "Ciudad"])

In [28]:
df_list

   Nombre  Edad           Ciudad
0  Miguel    25         Albacete
1  Emilio    30           Murcia
2   Pedro    28        Salamanca
3    Juan    35  Vilassar de Mar

In [29]:
import numpy as np

In [30]:
data_array = np.array( [[1,2,3], [4,5,6], [7,8,9]])

In [31]:
data_array

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [32]:
df_array = pd.DataFrame(data_array, columns=["A", "B", "C"])

In [33]:
df_array

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [34]:
type(df_array)

pandas.core.frame.DataFrame

In [35]:
data = { "Nombre" : ["Miguel", "Emilio", "Pedro", "Juan"],
        "Edad" : [25,30,28,35],
        "Ciudad": ["Albacete", "Murcia", "Salamanca", "Vilassar de Mar"]
       }
df = pd.DataFrame(data)
df

   Nombre  Edad           Ciudad
0  Miguel    25         Albacete
1  Emilio    30           Murcia
2   Pedro    28        Salamanca
3    Juan    35  Vilassar de Mar

In [36]:
type(data)

dict

In [37]:
df.to_csv("example.csv", index=False)

In [38]:
data = pd.read_csv("example.csv")
data

   Nombre  Edad           Ciudad
0  Miguel    25         Albacete
1  Emilio    30           Murcia
2   Pedro    28        Salamanca
3    Juan    35  Vilassar de Mar

In [39]:
df.to_excel("example.xlsx", index=False)

In [40]:
data_excel = pd.read_excel("example.xlsx")
data_excel

   Nombre  Edad           Ciudad
0  Miguel    25         Albacete
1  Emilio    30           Murcia
2   Pedro    28        Salamanca
3    Juan    35  Vilassar de Mar

In [41]:
data_excel.rename(columns = {"Edad": "Age", "Nombre": "Name", "Ciudad": "City"})

     Name  Age             City
0  Miguel   25         Albacete
1  Emilio   30           Murcia
2   Pedro   28        Salamanca
3    Juan   35  Vilassar de Mar

In [42]:
data_excel.at[1,"Nombre"] = "Antonio"
data_excel

    Nombre  Edad           Ciudad
0   Miguel    25         Albacete
1  Antonio    30           Murcia
2    Pedro    28        Salamanca
3     Juan    35  Vilassar de Mar

In [43]:
data = { "Nombre" : ["Miguel", "Emilio", "Pedro", "Juan"],
        "Edad" : [25,30,28,35],
        "Ciudad": ["Albacete", "Murcia", "Salamanca", "Vilassar de Mar"]
       }
df = pd.DataFrame(data)
df

   Nombre  Edad           Ciudad
0  Miguel    25         Albacete
1  Emilio    30           Murcia
2   Pedro    28        Salamanca
3    Juan    35  Vilassar de Mar

In [44]:
df[["Nombre", "Edad"]]

   Nombre  Edad
0  Miguel    25
1  Emilio    30
2   Pedro    28
3    Juan    35

In [45]:
type(df[["Nombre", "Edad"]])

pandas.core.frame.DataFrame

Con un solo corchete, devolverá una `Series`

In [46]:
df["Nombre"]

0    Miguel
1    Emilio
2     Pedro
3      Juan
Name: Nombre, dtype: object

In [47]:
type(df["Nombre"])

pandas.core.series.Series

In [48]:
df[["Nombre"]]

   Nombre
0  Miguel
1  Emilio
2   Pedro
3    Juan

In [49]:
type(df[["Nombre"]])

pandas.core.frame.DataFrame

In [50]:
df[["Nombre"]].values

array([['Miguel'],
       ['Emilio'],
       ['Pedro'],
       ['Juan']], dtype=object)

In [51]:
type(df[["Nombre"]].values)

numpy.ndarray

In [52]:
df[df["Nombre"] == "Pedro"]

  Nombre  Edad     Ciudad
2  Pedro    28  Salamanca

In [53]:
df[df["Edad"] > 28]

   Nombre  Edad           Ciudad
1  Emilio    30           Murcia
3    Juan    35  Vilassar de Mar

In [54]:
df[ (df["Ciudad"] == "Salamanca") & (df["Nombre"] == "Pedro") ]

  Nombre  Edad     Ciudad
2  Pedro    28  Salamanca

In [55]:
df[ (df["Ciudad"] == "Murcia") | (df["Edad"] > 30) ]

   Nombre  Edad           Ciudad
1  Emilio    30           Murcia
3    Juan    35  Vilassar de Mar

In [56]:
selected_cities = ["Murcia", "Salamanca"]

In [57]:
df[df["Ciudad"].isin(selected_cities)]

   Nombre  Edad     Ciudad
1  Emilio    30     Murcia
2   Pedro    28  Salamanca

In [58]:
df[df["Nombre"].str.startswith("J")]

  Nombre  Edad           Ciudad
3   Juan    35  Vilassar de Mar

Usaremos `iloc` para localizar índices.

In [59]:
df.iloc[1]

Nombre    Emilio
Edad          30
Ciudad    Murcia
Name: 1, dtype: object

In [60]:
type(df.iloc[1])

pandas.core.series.Series

In [61]:
df.iloc[0:2]

   Nombre  Edad    Ciudad
0  Miguel    25  Albacete
1  Emilio    30    Murcia

`loc`, por el contrario, nos servirá para filtrar valores según los encabezados de las columnas.

In [62]:
df.loc[df["Edad"] < 28]

   Nombre  Edad    Ciudad
0  Miguel    25  Albacete

In [63]:
df.loc[df["Edad"] < 28, ["Nombre", "Ciudad"]]

   Nombre    Ciudad
0  Miguel  Albacete

<h3>Missing data</h3>

In [64]:
import numpy as np

In [65]:
np.nan

nan

In [66]:
data = { "A" : [1,2, np.nan, 4, 5],
        "B" : [6, np.nan, 8, 9, 10],
        "C": [11, 12, 13, np.nan, 15]
       }
df = pd.DataFrame(data)
df

     A     B     C
0  1.0   6.0  11.0
1  2.0   NaN  12.0
2  NaN   8.0  13.0
3  4.0   9.0   NaN
4  5.0  10.0  15.0

In [67]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True  False  False
3  False  False   True
4  False  False  False

In [68]:
df.isnull().sum()

A    1
B    1
C    1
dtype: int64

In [69]:
df.dropna()

     A     B     C
0  1.0   6.0  11.0
4  5.0  10.0  15.0

In [70]:
df

     A     B     C
0  1.0   6.0  11.0
1  2.0   NaN  12.0
2  NaN   8.0  13.0
3  4.0   9.0   NaN
4  5.0  10.0  15.0

In [71]:
df.dropna(inplace=True)
df

     A     B     C
0  1.0   6.0  11.0
4  5.0  10.0  15.0

In [72]:
data = { "A" : [1,2, np.nan, 4, 5],
        "B" : [6, np.nan, 8, 9, 10],
        "C": [11, 12, 13, np.nan, 15]
       }
df = pd.DataFrame(data)
df

     A     B     C
0  1.0   6.0  11.0
1  2.0   NaN  12.0
2  NaN   8.0  13.0
3  4.0   9.0   NaN
4  5.0  10.0  15.0

In [73]:
df = df.dropna()
df

     A     B     C
0  1.0   6.0  11.0
4  5.0  10.0  15.0

In [74]:
data = { "A" : [1,2, np.nan, 4, 5],
        "B" : [6, np.nan, 8, 9, 10],
        "C": [11, 12, 13, np.nan, 15]
       }
df = pd.DataFrame(data)
df

     A     B     C
0  1.0   6.0  11.0
1  2.0   NaN  12.0
2  NaN   8.0  13.0
3  4.0   9.0   NaN
4  5.0  10.0  15.0

In [75]:
df.dropna(axis = 1) # columns

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [76]:
df.dropna(axis = 0) # rows

     A     B     C
0  1.0   6.0  11.0
4  5.0  10.0  15.0

In [77]:
data = { "A" : [1,2, np.nan, 4, 5],
        "B" : [6, np.nan, np.nan, 9, 10],
        "C": [11, 12, 13, np.nan, 15]
       }
df = pd.DataFrame(data)
df

     A     B     C
0  1.0   6.0  11.0
1  2.0   NaN  12.0
2  NaN   NaN  13.0
3  4.0   9.0   NaN
4  5.0  10.0  15.0

In [78]:
#only keep rows with at least 2 non-NaN values
df.dropna(thresh=2)

     A     B     C
0  1.0   6.0  11.0
1  2.0   NaN  12.0
3  4.0   9.0   NaN
4  5.0  10.0  15.0

In [79]:
#only keep rows with at least 1 non-NaN values
df.dropna(thresh=1)

     A     B     C
0  1.0   6.0  11.0
1  2.0   NaN  12.0
2  NaN   NaN  13.0
3  4.0   9.0   NaN
4  5.0  10.0  15.0

In [80]:
#only keep rows with at least 3 non-NaN values
df.dropna(thresh=3)

     A     B     C
0  1.0   6.0  11.0
4  5.0  10.0  15.0

In [81]:
df

     A     B     C
0  1.0   6.0  11.0
1  2.0   NaN  12.0
2  NaN   NaN  13.0
3  4.0   9.0   NaN
4  5.0  10.0  15.0

In [82]:
df.fillna(0) #to keep changes, include "inplace = True"

     A     B     C
0  1.0   6.0  11.0
1  2.0   0.0  12.0
2  0.0   0.0  13.0
3  4.0   9.0   0.0
4  5.0  10.0  15.0

In [83]:
df.fillna(df.mean())

     A          B      C
0  1.0   6.000000  11.00
1  2.0   8.333333  12.00
2  3.0   8.333333  13.00
3  4.0   9.000000  12.75
4  5.0  10.000000  15.00

In [84]:
df.fillna(df.median())

     A     B     C
0  1.0   6.0  11.0
1  2.0   9.0  12.0
2  3.0   9.0  13.0
3  4.0   9.0  12.5
4  5.0  10.0  15.0

In [85]:
df

     A     B     C
0  1.0   6.0  11.0
1  2.0   NaN  12.0
2  NaN   NaN  13.0
3  4.0   9.0   NaN
4  5.0  10.0  15.0

In [86]:
df.fillna(method = "ffill")

     A     B     C
0  1.0   6.0  11.0
1  2.0   6.0  12.0
2  2.0   6.0  13.0
3  4.0   9.0  13.0
4  5.0  10.0  15.0

In [87]:
df.fillna(method = "bfill")

     A     B     C
0  1.0   6.0  11.0
1  2.0   9.0  12.0
2  4.0   9.0  13.0
3  4.0   9.0  15.0
4  5.0  10.0  15.0

<h3>Data manipulation</h3>

In [88]:
data = { "A" : [1,2, 3, 4, 5],
        "B" : [6,7, 8, 9, 10],
        "C": [11, 12, 13, 14, 15]
       }
df = pd.DataFrame(data, index=["a", "b", "c", "d", "e"])
df

   A   B   C
a  1   6  11
b  2   7  12
c  3   8  13
d  4   9  14
e  5  10  15

In [89]:
df.loc["a"]

A     1
B     6
C    11
Name: a, dtype: int64

In [90]:
df.loc["a": "d"]

   A  B   C
a  1  6  11
b  2  7  12
c  3  8  13
d  4  9  14

In [91]:
df.loc[["a", "c"]]

   A  B   C
a  1  6  11
c  3  8  13

In [92]:
df.loc[["b", "e"], ["A", "C"]]

   A   C
b  2  12
e  5  15

In [93]:
df

   A   B   C
a  1   6  11
b  2   7  12
c  3   8  13
d  4   9  14
e  5  10  15

In [94]:
df.iloc[1]

A     2
B     7
C    12
Name: b, dtype: int64

In [95]:
df.iloc[[0,2]]

   A  B   C
a  1  6  11
c  3  8  13

In [96]:
df.iloc[0:3]

   A  B   C
a  1  6  11
b  2  7  12
c  3  8  13

In [97]:
df.iloc[[0,2],[1,2]]

   B   C
a  6  11
c  8  13

<h3>Queries</h3>

In [98]:
data = { "Name" : ["John", "Emily", "Kate", "Sam"],
        "Age" : [25,30,28,35],
        "City": ["New York", "San Francisco", "Chicago", "Seattle"]
       }
df = pd.DataFrame(data)
df

    Name  Age           City
0   John   25       New York
1  Emily   30  San Francisco
2   Kate   28        Chicago
3    Sam   35        Seattle

In [99]:
df[df["Age"] < 32]

    Name  Age           City
0   John   25       New York
1  Emily   30  San Francisco
2   Kate   28        Chicago

In [100]:
df[(df["City"] == "Chicago") & (df["Age"] < 30)]

   Name  Age     City
2  Kate   28  Chicago

In [101]:
df.query("Age > 28")

    Name  Age           City
1  Emily   30  San Francisco
3    Sam   35        Seattle

In [102]:
df.query("Age > 28 and City == 'San Francisco'")

    Name  Age           City
1  Emily   30  San Francisco

In [103]:
df.query("Age * 2 > 50")

    Name  Age           City
1  Emily   30  San Francisco
2   Kate   28        Chicago
3    Sam   35        Seattle

<h3>Sorting</h3>

In [104]:
df

    Name  Age           City
0   John   25       New York
1  Emily   30  San Francisco
2   Kate   28        Chicago
3    Sam   35        Seattle

In [105]:
df.sort_values("Age", ascending = False)

    Name  Age           City
3    Sam   35        Seattle
1  Emily   30  San Francisco
2   Kate   28        Chicago
0   John   25       New York

In [106]:
df.sort_values(["City", "Age"])

    Name  Age           City
2   Kate   28        Chicago
0   John   25       New York
1  Emily   30  San Francisco
3    Sam   35        Seattle

In [107]:
df

    Name  Age           City
0   John   25       New York
1  Emily   30  San Francisco
2   Kate   28        Chicago
3    Sam   35        Seattle

`df["Age"].rank()` calcula las clasificaciones de los valores de la columna "Age" sin especificar un método. Cuando no se especifica un método, el método predeterminado es "average" (promedio). Esto significa que, si hay valores idénticos en la columna "Age," se les asignará un rango promedio. Por ejemplo, si dos filas tienen un valor de edad de 30, ambas recibirán un rango promedio de (1 + 2) / 2 = 1.5.

In [108]:
df["Age"].rank()

0    1.0
1    3.0
2    2.0
3    4.0
Name: Age, dtype: float64

`df["Age"].rank(method="min")` calcula las clasificaciones de los valores de la columna "Age" utilizando el método "min." Con este método, si hay valores idénticos, se les asignará el rango mínimo. Siguiendo el ejemplo anterior, si dos filas tienen un valor de edad de 30, ambas recibirán un rango mínimo de 1.

In [109]:
df["Age"].rank(method="min")

0    1.0
1    3.0
2    2.0
3    4.0
Name: Age, dtype: float64

<h3>Combinación y fusión de DataFrames</h3>

In [110]:
data1 = {'A': [1, 2, 3],
         'B': [4, 5, 6]}
data2 = {'A': [7, 8, 9],
         'B': [10, 11, 12]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [111]:
print(df1)
print(df2)

   A  B
0  1  4
1  2  5
2  3  6
   A   B
0  7  10
1  8  11
2  9  12

In [112]:
pd.concat([df1,df2]) # por defecto, se combinan las filas

   A   B
0  1   4
1  2   5
2  3   6
0  7  10
1  8  11
2  9  12

In [113]:
pd.concat([df1,df2], axis = 1) # combinamos por columnas

   A  B  A   B
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [114]:
data3 = {'A': [1, 2, 3],
         'C': [13, 14, 15]}
df3 = pd.DataFrame(data3)
print(df1)
print(df3)

   A  B
0  1  4
1  2  5
2  3  6
   A   C
0  1  13
1  2  14
2  3  15

In [115]:
pd.merge(df1, df3, on="A")

   A  B   C
0  1  4  13
1  2  5  14
2  3  6  15

<h3>Cleaning</h3>

In [116]:
data = {'A': [1, 2, 2, 3, 3],
         'B': [4, 5, 5, 6, 7]}
df = pd.DataFrame(data)
df

   A  B
0  1  4
1  2  5
2  2  5
3  3  6
4  3  7

In [117]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [118]:
df.drop_duplicates()

   A  B
0  1  4
1  2  5
3  3  6
4  3  7

In [119]:
print(df)
df.drop_duplicates(subset = ["A"])

   A  B
0  1  4
1  2  5
2  2  5
3  3  6
4  3  7

   A  B
0  1  4
1  2  5
3  3  6

In [120]:
df.describe()

             A         B
count  5.00000  5.000000
mean   2.20000  5.400000
std    0.83666  1.140175
min    1.00000  4.000000
25%    2.00000  5.000000
50%    2.00000  5.000000
75%    3.00000  6.000000
max    3.00000  7.000000

In [121]:
data = {'A': [1, 2, 2, 3, 11, 11],
         'B': [4, 5, 5, 6, 12, 25]}
df = pd.DataFrame(data)
df

    A   B
0   1   4
1   2   5
2   2   5
3   3   6
4  11  12
5  11  25

In [122]:
df.describe()

               A          B
count   6.000000   6.000000
mean    5.000000   9.500000
std     4.690416   8.117881
min     1.000000   4.000000
25%     2.000000   5.000000
50%     2.500000   5.500000
75%     9.000000  10.500000
max    11.000000  25.000000

In [123]:
q_low = df["B"].quantile(0.25)
q_high = df["B"].quantile(0.75)
print(f"q_low: {q_low}\nq_high: {q_high}")

q_low: 5.0
q_high: 10.5

In [124]:
q_range = q_high - q_low
print(q_range)

5.5

In [125]:
lower_bound = q_low - 1.5 * q_range
upper_bound = q_high + 1.5 * q_range
print(f"lower_bound: {q_low - 1.5 * q_range}")
print(f"upper_bound: {q_high + 1.5 * q_range}")
df

lower_bound: -3.25
upper_bound: 18.75

    A   B
0   1   4
1   2   5
2   2   5
3   3   6
4  11  12
5  11  25

In [126]:
df_filtered = df[(df['B'] > lower_bound) & (df['B'] < upper_bound)]
df_filtered

    A   B
0   1   4
1   2   5
2   2   5
3   3   6
4  11  12

<h3>Categorical data</h3>

In [128]:
data = {"Category": ['A', 'B', 'A', 'C', 'B', 'A']}
df = pd.DataFrame(data)
df

  Category
0        A
1        B
2        A
3        C
4        B
5        A

In [130]:
pd.get_dummies(df["Category"])[['A', 'B']]

       A      B      C
0   True  False  False
1  False   True  False
2   True  False  False
3  False  False   True
4  False   True  False
5   True  False  False

In [131]:
pd.get_dummies(df["Category"])[['A', 'B']]

       A      B
0   True  False
1  False   True
2   True  False
3  False  False
4  False   True
5   True  False

***Encoding Categorical data***

In [133]:
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()
df["Category_labelEncoded"] = label_encoder.fit_transform(df["Category"])
df

  Category  Category_labelEncoded
0        A                      0
1        B                      1
2        A                      0
3        C                      2
4        B                      1
5        A                      0

In [136]:
data = {"Category": ['A', 'B', 'A', 'C', 'B', 'A'],
       "Sales": [10, 20, 30, 40, 50, 60]}
df = pd.DataFrame(data)
df

  Category  Sales
0        A     10
1        B     20
2        A     30
3        C     40
4        B     50
5        A     60

In [137]:
df.groupby("Category").size()

Category
A    3
B    2
C    1
dtype: int64

In [140]:
type(df.groupby("Category").size())

pandas.core.series.Series

In [138]:
df.groupby("Category").agg({"Category":"count"})

          Category
Category
A                3
B                2
C                1

In [139]:
type(df.groupby("Category").agg({"Category":"count"}))

pandas.core.frame.DataFrame

In [141]:
df.groupby("Category").size().reset_index()

  Category  0
0        A  3
1        B  2
2        C  1

In [142]:
type(df.groupby("Category").size().reset_index())

pandas.core.frame.DataFrame

<h3>Data transformation techniques</h3>

In [143]:
data = {"Name": ['John', 'Emily', 'Kate'],
        "Math": [90, 85, 88],
        "Science": [92, 80, 95]}
df = pd.DataFrame(data)
df

    Name  Math  Science
0   John    90       92
1  Emily    85       80
2   Kate    88       95

In [144]:
pd.melt(df, id_vars = ["Name"], var_name = "Subject", value_name = "Score")

    Name  Subject  Score
0   John     Math     90
1  Emily     Math     85
2   Kate     Math     88
3   John  Science     92
4  Emily  Science     80
5   Kate  Science     95

In [148]:
df_melted = pd.melt(df, id_vars = ["Name"], var_name = "Subject", value_name = "Score")
df_melted.pivot(index = "Name", columns = "Subject", values = "Score")

Subject  Math  Science
Name
Emily      85       80
John       90       92
Kate       88       95

<h3>Date and Time data</h3>

In [151]:
data = {"Date": ['2023-01-01', '2023-01-02', '2023-01-03'],
        "Sales": [199, 150, 200]}
df = pd.DataFrame(data)
print(df)
print(df.dtypes)

         Date  Sales
0  2023-01-01    199
1  2023-01-02    150
2  2023-01-03    200
Date     object
Sales     int64
dtype: object

In [152]:
df["Date"] = pd.to_datetime(df["Date"])
print(df)
df.dtypes

        Date  Sales
0 2023-01-01    199
1 2023-01-02    150
2 2023-01-03    200

Date     datetime64[ns]
Sales             int64
dtype: object

In [155]:
df["Year"] = df["Date"].dt.year
df["Month"] = df["Date"].dt.month
df["Day"] = df["Date"].dt.day
print(df)
df.dtypes

        Date  Sales  Year  Month  Day
0 2023-01-01    199  2023      1    1
1 2023-01-02    150  2023      1    2
2 2023-01-03    200  2023      1    3

Date     datetime64[ns]
Sales             int64
Year              int32
Month             int32
Day               int32
dtype: object

In [157]:
time_index = pd.date_range('2023-01-01', periods = 5, freq = "D")
ts_data = pd.Series([100, 120, 80, 110, 90], index = time_index)
print(time_index)
ts_data

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05'],
              dtype='datetime64[ns]', freq='D')

2023-01-01    100
2023-01-02    120
2023-01-03     80
2023-01-04    110
2023-01-05     90
Freq: D, dtype: int64

In [163]:
ts_resampled = ts_data.resample("M").mean()
ts_resampled

2023-01-31    100.0
Freq: M, dtype: float64

In [175]:
data = {"Date": ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05'],
        "Sales": [100, 150, 200, 120, 180]}
df = pd.DataFrame(data)
df

         Date  Sales
0  2023-01-01    100
1  2023-01-02    150
2  2023-01-03    200
3  2023-01-04    120
4  2023-01-05    180

In [176]:
df["Date"] = pd.to_datetime(df["Date"])
df.index

RangeIndex(start=0, stop=5, step=1)

In [177]:
df.set_index("Date", inplace = True)
df

            Sales
Date
2023-01-01    100
2023-01-02    150
2023-01-03    200
2023-01-04    120
2023-01-05    180

In [178]:
df.index

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05'],
              dtype='datetime64[ns]', name='Date', freq=None)

In [179]:
df["Shifted_Sales"] = df["Sales"].shift(1)
df["Lagged_Sales"] = df["Sales"].shift(-1)
df

            Sales  Shifted_Sales  Lagged_Sales
Date
2023-01-01    100            NaN         150.0
2023-01-02    150          100.0         200.0
2023-01-03    200          150.0         120.0
2023-01-04    120          200.0         180.0
2023-01-05    180          120.0           NaN

In [180]:
date_range = pd.date_range(start = "2023-01-02", periods = 10, freq = "W")
date_range

DatetimeIndex(['2023-01-08', '2023-01-15', '2023-01-22', '2023-01-29',
               '2023-02-05', '2023-02-12', '2023-02-19', '2023-02-26',
               '2023-03-05', '2023-03-12'],
              dtype='datetime64[ns]', freq='W-SUN')

<h3>Groupby operations</h3>

In [181]:
data = {"Category": ['A', 'B', 'A', 'B', 'A'],
       "Sales": [10, 15, 20, 25, 30]}
df = pd.DataFrame(data)
df

  Category  Sales
0        A     10
1        B     15
2        A     20
3        B     25
4        A     30

In [182]:
df.groupby("Category").sum()

          Sales
Category
A            60
B            40

In [183]:
df.groupby("Category").agg(["sum", "mean", "max"])

         Sales
           sum  mean max
Category
A           60  20.0  30
B           40  20.0  25

<h3>Aggregating data</h3>

Punto 1:05:44